In [115]:
import pandas as pd
from sqlalchemy import create_engine 
from datetime import datetime
import time

In [2]:
air_pollution = "../pollution_clean.csv"
pollution_df = pd.read_csv(air_pollution)
pollution_df.head(1)

,County,State,City,Date Local,NO2 Mean,O3 Mean,SO2 Mean,CO Mean
0,Maricopa,Arizona,Phoenix,2009-01-03,22.541667,0.00975,1.333333,0.308333

In [97]:
new_poll_df = pollution_df[(pollution_df["Date Local"]>"2009-01-02") & (pollution_df["Date Local"] <= "2012-12-31")]
new_poll_df.head()

pollution = pollution.fillna(0)

pollution['id'] = range(len(pollution))
pollution.set_index("id", inplace=True)

pollution.head()

,State,County,City,Date Local,NO2 Mean,O3 Mean,SO2 Mean,CO Mean
id,,,,,,,,
0,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.333333,0.308333
1,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.333333,0.412500
2,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.312500,0.308333
3,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.312500,0.412500
4,Arizona,Maricopa,Phoenix,2009-01-04,19.250000,0.010208,0.666667,0.287500

In [120]:
pollution.rename(columns={'State': 'state','County':'county', 'City':'city', 'Date Local':'date_local', 'NO2 Mean':'NO2_mean','O3 Mean':'O3_mean', 'SO2 Mean':'SO2_mean', 'CO Mean':'CO_mean'}, inplace=True)

pollution['year'] = pollution['date_local'].apply(lambda x: x.split('-')[0])

#pollution['year'] = pollution.to_datetime(pollution['date_local']).dt.year


#pollution.head()

In [121]:
pollution.head()

,state,county,city,date_local,NO2_mean,O3_mean,SO2_mean,CO_mean,year
id,,,,,,,,,
0,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.333333,0.308333,2009
1,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.333333,0.412500,2009
2,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.312500,0.308333,2009
3,Arizona,Maricopa,Phoenix,2009-01-03,22.541667,0.009750,1.312500,0.412500,2009
4,Arizona,Maricopa,Phoenix,2009-01-04,19.250000,0.010208,0.666667,0.287500,2009

In [63]:
asthma_data = "../asthma_clean.csv"
asthma_df = pd.read_csv(asthma_data)
#asthma_df.columns = ['Unnamed: 0','county', 'year', 'age', 'number_of_visits']
#asthma_df.rename(columns={'Unnamed: 0':'id','county': 'age', 'year': 'number_of_visits', 'age': 'county', 'number_of_visits':'year'}, inplace=True)

asthma_df.head(5)

   id       county  year              age  number_of_visits
0   0  Los Angeles  2012          AllAges             433.0
1   1  Los Angeles  2012  Children (0-17)             221.0
2   2  Los Angeles  2012     Adults (18+)             212.0
3   3  Los Angeles  2012          AllAges             438.0
4   4  Los Angeles  2012  Children (0-17)             215.0

In [85]:
asthma = asthma_df[["id","year", "age", "number_of_visits", "county"]].copy()
#asthma['county'] = asthma['county'].str.title()
asthma.set_index("id", inplace=True) 

asthma = asthma.fillna(0)

asthma.tail()

      year              age  number_of_visits     county
id
7081  2009  Children (0-17)              16.0  El Dorado
7082  2009     Adults (18+)              26.0  El Dorado
7083  2009         All Ages              16.0     Nevada
7084  2009  Children (0-17)               0.0     Nevada
7085  2009     Adults (18+)               0.0     Nevada

In [122]:
pollution.to_csv("../pollution_clean.csv")

In [87]:
asthma.to_csv("../asthma_clean.csv")

In [88]:
rds_connection_string = "postgres:postgres@localhost:5432/asthma_vs_pollution_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [123]:
engine.table_names()

['asthma', 'pollution']

In [90]:
asthma.to_sql(name='asthma', con=engine, if_exists='append', index=True)

In [124]:
pollution.to_sql(name="pollution", con=engine, if_exists='append', index=True)